{
  "Name": "Plugin Name",
  "Author": "Author Name",
  "Description": "A short description of your plugin.",
  "NexusUrl": "URL to the Nexus page for your plugin.",
  "GithubUrl": "URL to the Github page for your plugin.",
  "DocsUrl": "URL to the documentation or readme for your plugin.",

  "Released": "Date of this version's release, in format yyyy-MM-dd (Default if Versions not specified)",
  "MinSupport": "Minimum version of Mod Organizer this release has been tested on. Versions earlier than this may work, but have not been tested. (Default if Versions not specified)",
  "MaxSupport": "Maxmimum version of Mod Organizer this release has been tested on. Versions later than this may work, but have not been tested. (Default if Versions not specified)",
  "MinWorking": "Minimum version of Mod Organizer that this release is known to work on. Versions earlier than this do not work and have been tested. (Default if Versions not specified)",
  "MaxWorking": "Maximum version of Mod Organizer that this release is known to work on. Versions later than this do not work and have been tested. (Default if Versions not specified)",
  "DownloadUrl": "Direct download URL of the zipped release of this plugin. (Default if Versions not specified)",
  "PluginPath": [ "Array of paths, relative to the zipped download. Any files or folders specified will be copied to the Mod Organizer plugins folder on install. (Default if Versions not specified)" ],
  "LocalePath": [ "Array of paths, relative to the zipped download. Any files or folders specified will be copied to the Mod Organizer translations folder on install. (Default if Versions not specified)" ],
  "DataPath": [ "Array of paths, relative to the Mod Organizer plugins folder. Any files or folders specified will be deleted when the plugin is uninstalled. (Default if Versions not specified)" ],

  "Versions": [
    {
      "Version": "Version of this release.",
      "Released": "Date of this release, in format yyyy-MM-dd",
      "MinSupport": "Minimum version of Mod Organizer this release has been tested on. Versions earlier than this may work, but have not been tested.",
      "MaxSupport": "Maxmimum version of Mod Organizer this release has been tested on. Versions later than this may work, but have not been tested.",
      "MinWorking": "Minimum version of Mod Organizer that this release is known to work on. Versions earlier than this do not work and have been tested.",
      "MaxWorking": "Maximum version of Mod Organizer that this release is known to work on. Versions later than this do not work and have been tested.",
      "DownloadUrl": "Direct download URL of the zipped release of this plugin",
      "PluginPath": [ "Array of paths, relative to the zipped download. Any files or folders specified will be copied to the Mod Organizer plugins folder on install." ],
      "LocalePath": [ "Array of paths, relative to the zipped download. Any files or folders specified will be copied to the Mod Organizer translations folder on install." ],
      "DataPath": [ "Array of paths, relative to the Mod Organizer plugins folder. Any files or folders specified will be deleted when the plugin is uninstalled." ],
      "ReleaseNotes": [ "Array of release notes for this release." ]
    }
  ]
}